# 1. HTML 정의
# 아래의 보기 (1) ~ (4) 중에서, HTML의 본딧말을 고르시오.  -- 4번

# (1) Hyperlinks and Text Markup Language
# (2) Home Tool Markup Language
# (3) Hyper Text Markup Language
# (4) Hyper Tool Markup Language


# =======================================================================================================================================================================================

# 2. HTML 개념
# 각 문항을 읽고 맞으면 T, 틀리면 F를 작성 하시오.

# 1) 웹 표준을 만드는 곳은 Mozilla 재단이다. --> F   
#      모질라 재단은 스마트폰 운영체제를 제작하기로 한다. firefox OS라고 한다. 파이어폭스의 엔진을 사용하는 HTML5기반 웹 OS이다.
#      HTML 표준을 제정하는 두 단체, 월드와이드웹컨소시엄(W3C)와 웹하이퍼텍스트애플리케이션기술 작업반(WHATWG)이 제각각 만들던 HTML과 문서객체모델(DOM) 규격을 단일 버전으로 내놓기로 했다.
# 
# 2) 표(table) 을 만들 때에는 반드시 <th> 태그를 사용해야 한다. --> F 
#       <th> 태그는 행의 제목을 표시하는 태그이며 보통 <tr> 태그의 자식요소로 가장 윗부분에 적습니다. 
#       <table> 태그는 표의 시작과 끝을 알리며 표 태그 전체를 감싸는 태그입니다.
# 
# 3) 제목(Heading) 태그는 제목 이외에는 사용하지 않는 것이 좋다. --> T
#       제목태그는 검섹엔진이 제목 태그를 중요한 의미로 받아들이기 떄문에 제목 이외에는 사용하지 않는 것이 좋다.
# 
# 
# 4) 리스트를 나열하기 위해서는 <ul> 태그만 사용 할 수 있다. --> F
#       ol (ordered list) : 항목을 순서 붙여서 나열 --> 1. 2. 3.
#       ul (unorderd list) : 항목을 순서없이 나열 --> - - -
# 
# 5) HTML의 태그는 반드시 별도의 닫는 태그가 필요하다. --> T

# =======================================================================================================================================================================================

# 3. CSS 정의
# 아래의 보기 (1) ~ (4) 중에서, CSS의 본딧말을 고르시오  -- (2)

# (1) Creative Style Sheets
# (2) Cascading Style Sheets
# (3) Computer Style Sheets
# (4) Colorful Style Sheets

# =======================================================================================================================================================================================

# 4. CSS 개념
# 각 문항을 읽고 맞으면 T, 틀리면 F를 작성 하시오.

# 1) HTML과 CSS는 각자 문법을 갖는 별개의 언어이다. --> T
#       HTML과 CSS는 각자의 문법을 갖는 별개의 언어이며 HTML은 CSS를 포함할 수 있다.

# 2) 웹 브라우저는 내장 기본 스타일이 있어 CSS가 없어도 작동한다.  --> T
#       다만 웹브러우저에 따라 디폴트 스타일이 상이하고 지원하는 tag나 style도 제각각이어서 주의가 필요하다.

# 3) 자식 요소 프로퍼티는 부모의 프로퍼티를 모두 상속 받는다.  --> F
#       상속을 통해서 상위 요소에 적용된 프로퍼티를 하위 요소가 물려받는 것을 의미한다.  다만 모든 프로퍼티가 상속되는 것은 아니다. ex. width, height

# 4) 디바이스마다 화면의 크기가 다른 것을 고려하여 상대 단위인 %를 사용한다. --> T
#       

# 5) id 값은 유일해야 하므로 중복되어서는 안된다.  --> T
#       중복해서 왠만하면 사용하지 않아야 한다.


# =======================================================================================================================================================================================

# 5. CSS 우선순위
# CSS는 우선 적용되는 순서가 존재 한다. 우선순위가 높은 순으로 나열 하시오.

# 요소 선택자, Inline Style, 소스 순서,
# !important, id 선택자, class 선택자

# 1. !important, Inline style, id 선택자, class 선택자, 소수 순서, 요소 선택자